In [1]:
import pandas as pd
import numpy as np

In [59]:
mydict = {'RN':[1,2,3,4,5,6],'SName':['om','sham','ram','jam','kam','dam']}

In [61]:
df1 = pd.DataFrame(mydict)
df1

   RN SName
0   1    om
1   2  sham
2   3   ram
3   4   jam
4   5   kam
5   6   dam

In [63]:
mydict2 = {'RN':[1,2,3,4,5,6],'Marks':[12,13,15,17,18,18]}

In [65]:
df2 = pd.DataFrame(mydict2)

In [67]:
df = pd.merge(df1,df2,on='RN')

In [69]:
df

   RN SName  Marks
0   1    om     12
1   2  sham     13
2   3   ram     15
3   4   jam     17
4   5   kam     18
5   6   dam     18

In [71]:
pd.unique(df["Marks"]).shape

(5,)

In [75]:
df3 = pd.DataFrame({"RN": [6],"SName":["nish"],"Marks":[30]})
df3

   RN SName  Marks
0   6  nish     30

In [83]:
p = df3.pivot(index='RN',columns='SName',values='Marks')

In [106]:
p

SName  nish
RN
6        30

### Back fill and forward fill in pandas

In [91]:
mydict2 = {'RN':[1,2,None,4,None,6],'Marks':[12,13,None,17,18,18]}
df4 = pd.DataFrame(mydict2)
df4

    RN  Marks
0  1.0   12.0
1  2.0   13.0
2  NaN    NaN
3  4.0   17.0
4  NaN   18.0
5  6.0   18.0

In [102]:
df4.bfill(axis='rows')

    RN  Marks
0  1.0   12.0
1  2.0   13.0
2  4.0   17.0
3  4.0   17.0
4  6.0   18.0
5  6.0   18.0

In [97]:
df4.ffill()

    RN  Marks
0  1.0   12.0
1  2.0   13.0
2  2.0   13.0
3  4.0   17.0
4  4.0   18.0
5  6.0   18.0